// Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання
//  (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

// Кілометри в метри
// години в хвилини
// Кілограми в грами
// Зробити вивід отриманої інформації у вигляді - 10 км це 10000 м. 1 г це 60хв. 1 кг. це 1000 грм. 

// Умови виконання ДЗ

// В задачі не обов'язково використовувати prompt, просто запишіть значення в зміні
// Обов'язково при написані завдання використовуйте switch
// Продумати варіант якщо буде введена якась інша одиниця виміру
// Мудрувати та створювати валідацію не потрібно


// var unit = "кілограми";
// var quantity = 2;

//     switch (unit) {
//         case "кілометри":
//             console.log(quantity + " км це " + quantity  * 1000 + " м.");
//             break;
//         case "години":
//             console.log(quantity + " годин це " + quantity * 60 + " хв.");
//             break;quantity
//         case "кілограми":
//             console.log(quantity + " кілограм це " + quantity * 1000 + " грм.");
//             break;
//             case "міля":
//             console.log(quantity + " міль це " + quantity * 1.6 + " км.");
//             break;    
//         default:
//             console.log("Одиниця виміру не знайдена");
//     }