

// Необхідно написати програму яка буде виводити інформацію за умовами
//  при яких число виводитиметься з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

// Умови виконання ДЗ

// Рік отримувати через prompt()
// Зробити перевірку що користувач ввів число та це число не є від'ємним
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.


// var userAge = prompt("Вкажіть Ваш вік", "");

// if (userAge < 0) {
//     console.log("Будь ласка введіть Ваш вік, наприклад 18");
// } else if (isNaN(userAge)) {
//     console.log("Будь ласка введіть Ваш вік, наприклад 18");
// } else {
//      if (age === 0) {
//         console.log(userAge + " років");
//     }  else if (age % 10 === 1 && age % 100 !== 11) {
//         console.log(age + " рік");
//     } else if (userAge % 10 >= 2 && userAge % 10 <= 4 && (userAge % 100 < 10 || userAge % 100 >= 20)) {
//          console.log(userAge + " роки");
//     } else {
//          console.log(userAge + " років");
//     }
// }




