// Вам необхідно намалювати в консолі прямокутний трикутник із зірочок
//  (або плюсиків, або якогось іншого символу):
//  на першому рядку - одна зірочка, на другій дві, і так далі. 
// Рішення оформіть у вигляді функції, куди передаються два параметри:
//   висота трикутника та символ, яким його потрібно "малювати".

// Якось так:

// drawTriangle(5, *);

// *

// **

// ***

// ****

// *****


//                                 1 спосіб

// function drawTriangle(h, s) {
//     var i = 1;
//     while (i <= h) {
//         var row = '';
//         var j = 1;
//         while (j <= i) {
//             row += s;
//             j++;
//         }
//         switch (i) {
//             case 1:
//                 console.log(row);
//                 break;
//             default:
//                 console.log("" + row);
//                 break;
//         }
//         i++;
//     }
// }
// drawTriangle(4, "*");



//                                  2 спосіб

// function drawTriangle(h, s) {
//     for (var i = 1; i <= h; i++) {
//         var q = '';
//         for (var j = 1; j <= i; j++) {
//             q += s;
//         }
//         console.log(" " + q);
//     }
// }
// drawTriangle(5, "^");