// Вам необхідно намалювати в консолі прямокутний трикутник із зірочок
//  (або плюсиків, або якогось іншого символу):
//  на першому рядку - одна зірочка, на другій дві, і так далі. 
// Рішення оформіть у вигляді функції, куди передаються два параметри:
//   висота трикутника та символ, яким його потрібно "малювати".

// Якось так:

// drawTriangle(5, *);

// *

// **

// ***

// ****

// *****


//                                 1 спосіб

// var h = 6;
// var s = '^';

// for (var i = 1; i <= h; i++) {
//     var f = '  ';
//     for (var j = 1; j <= i; j++) {
//         f += s;
//     }
//     console.log(" " + f);
// }

//                                  2 спосіб

// function drawTriangle(h, s) {
//     for (var i = 1; i <= h; i++) {
//         var q = '';
//         for (var j = 1; j <= i; j++) {
//             q += s;
//         }
//         console.log(" " + q);
//     }
// }
// drawTriangle(5, "^");