// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.

// Умови виконання ДЗ

// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_hw_loops.
// Додати туди ваше домашнє завдання
// Вислати вашу гілку

// Там потрібно порахувати суму чисел, тобто 1+2+3+4+....+100 = ? Тут потрібна змінна лічільник, до котрої буде все додаватись...

// var sum = 0;
// for (var i = 1; i <= 100; i++) {
//     if (i % 3 !== 0) {
//         sum += i;
//     }
// }
// console.log("Сума чисел від 1 до 100, не кратних 3: " + sum);