// Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.

// Умови виконання ДЗ

// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
// Будь ласка, надайте наступні дані для перевірки вашої роботи:

// Створіть гілку js_hw_loops.
// Додати туди ваше домашнє завдання
// Вислати вашу гілку



// for (let i = 0; i <= 100; i++){
//     for (let  j = 1; j <= 1; j++){
//          if ((i + j) % 3 !== 0) 
//      console.log(" Результат сумми " +  i + " + " + j + " = " + (i + j));
//  }
//  console.log(" ")
// }


//  або так 


// for (let i = 0; i <= 100; i++){
//     for (let  j = 1; j <= 1; j++){
//          if ((i + j) % 3 !== 0) 
//      console.log("Сума чисел які не кратні 3 буде " +  i + " + " + j + " = " + (i + j));
//  }
// }
