// Написати функцію pow(x,y) яка буде приймати 2 числа, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.

// Наприклад pow(2,3) функція поверне значення 8. 

// Умови виконання ДЗ

// Не використовувати **
// Не використовувати функції або інші матеріали які ми не вивчали
// Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки

// function pow(a, b) {
//     var c = a;
//     for (var i = 1; i < b; i++) {
//         c *= a;
//     }
//     return c;
// }
// console.log(pow(3, 4));